if __FILE__ == $0

s1 = 0
s2 = 0
till = 200

1.upto(till) do |a|

	s1 = s1 + a	
	s2 = s2 + a*a
	
end

s1 = s1*s1

puts "S=#{s1}-#{s2}=#{s1-s2}"

puts "Second one:"

a1 = (200*201)/2
a1 = a1*a1

a2 = (200*201*401)/6

puts "S=#{a1}-#{a2}=#{a1-a2}"
puts

end

# Сумма чисел от 1 до n равна n(n+1)/2, сумма квадратов чисел равна n(n+1)(2n+1)/6. 
# То есть то, что нужно найти, есть n^2 (n+1)^2 /4 - n(n+1)(2n+1)/6 = n(n+1)/12 * (3n(n+1)-2(2n+1)) = n(n+1)(3n^2-n-2)/12 = (n-1)n(n+1)(3n+2)/12.
# Далее просто подставляем n=200.

